memtier_benchmark_test/Redis_Experiment_I_OFF_3nd/memtier_benchmark_I_OFF_3nd_Random110_P1_20230330012313.log
20        Threads
5         Connections per thread
900       Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       114441.90          ---          ---        25.44193        23.67900        46.84700        62.46300    237330.18 
Gets        11444.14     11444.14         0.00        25.12708        23.42300        46.59100        61.95100     23677.03 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     125886.04     11444.14         0.00        25.41331        23.67900        46.84700        62.46300    261007.21 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       1.815        0.000
SET      17.535        5.000
SET      20.223       10.000
SET      20.863       15.000
SET      21.375       20.000
SET      21.631       25.000
SET      21.887       30.000
SET      22.271       35.000
SET      22.783       40.000
SET      23.167       45.000
SET      23.679       50.000
SET      23.935       52.500
SET      24.319       55.000
SET      24.575       57.500
SET      24.959       60.000
SET      25.215       62.500
SET      25.599       65.000
SET      25.983       67.500
SET      26.367       70.000
SET      26.879       72.500
SET      27.391       75.000
SET      27.647       76.250
SET      28.031       77.500
SET      28.543       78.750
SET      29.183       80.000
SET      29.567       81.250
SET      29.951       82.500
SET      30.335       83.750
SET      30.591       85.000
SET      30.975       86.250
SET      31.615       87.500
SET      32.127       88.125
SET      32.639       88.750
SET      33.279       89.375
SET      33.535       90.000
SET      34.047       90.625
SET      34.559       91.250
SET      35.327       91.875
SET      36.095       92.500
SET      37.119       93.125
SET      37.887       93.750
SET      38.399       94.062
SET      38.655       94.375
SET      39.167       94.688
SET      39.679       95.000
SET      39.935       95.312
SET      40.447       95.625
SET      40.959       95.938
SET      41.471       96.250
SET      41.983       96.562
SET      42.495       96.875
SET      42.751       97.031
SET      43.007       97.188
SET      43.263       97.344
SET      43.519       97.500
SET      43.775       97.656
SET      44.031       97.812
SET      44.287       97.969
SET      44.543       98.125
SET      44.799       98.281
SET      45.311       98.438
SET      45.311       98.516
SET      45.567       98.594
SET      45.823       98.672
SET      46.079       98.750
SET      46.335       98.828
SET      46.591       98.906
SET      46.847       98.984
SET      47.103       99.062
SET      47.359       99.141
SET      47.615       99.219
SET      47.871       99.258
SET      48.127       99.297
SET      48.383       99.336
SET      48.383       99.375
SET      48.639       99.414
SET      48.895       99.453
SET      49.151       99.492
SET      49.407       99.531
SET      49.919       99.570
SET      50.175       99.609
SET      50.431       99.629
SET      50.687       99.648
SET      50.943       99.668
SET      51.199       99.688
SET      51.455       99.707
SET      51.967       99.727
SET      52.479       99.746
SET      53.247       99.766
SET      54.271       99.785
SET      55.295       99.805
SET      55.551       99.814
SET      56.063       99.824
SET      56.831       99.834
SET      57.599       99.844
SET      58.111       99.854
SET      59.135       99.863
SET      59.903       99.873
SET      60.927       99.883
SET      61.951       99.893
SET      62.719       99.902
SET      63.743       99.907
SET      64.767       99.912
SET      65.279       99.917
SET      66.047       99.922
SET      67.071       99.927
SET      67.583       99.932
SET      68.607       99.937
SET      69.631       99.941
SET      70.655       99.946
SET      72.703       99.951
SET      73.215       99.954
SET      73.727       99.956
SET      75.263       99.958
SET      77.311       99.961
SET      78.335       99.963
SET      81.407       99.966
SET      84.479       99.968
SET     167.935       99.971
SET     217.087       99.973
SET     228.351       99.976
SET     231.423       99.977
SET     236.543       99.978
SET     239.615       99.979
SET     245.759       99.980
SET     251.903       99.982
SET     253.951       99.983
SET     264.191       99.984
SET     278.527       99.985
SET     305.151       99.987
SET     315.391       99.988
SET     319.487       99.988
SET     323.583       99.989
SET     327.679       99.990
SET     329.727       99.990
SET     331.775       99.991
SET     333.823       99.991
SET     344.063       99.992
SET     344.063       99.993
SET     346.111       99.993
SET     356.351       99.994
SET     356.351       99.994
SET     399.359       99.995
SET     403.455       99.995
SET     403.455       99.995
SET     405.503       99.995
SET     405.503       99.996
SET     413.695       99.996
SET     419.839       99.996
SET     419.839       99.997
SET     419.839       99.997
SET     419.839       99.997
[...]
SET     428.031       99.997
SET     432.127       99.998
SET     432.127       99.998
SET     432.127       99.998
[...]
SET     434.175       99.998
SET     434.175       99.998
SET     434.175       99.998
SET     436.223       99.999
SET     436.223       99.999
SET     436.223       99.999
SET     444.415       99.999
SET     444.415       99.999
SET     444.415       99.999
[...]
SET     448.511       99.999
SET     448.511       99.999
SET     448.511      100.000
SET     448.511      100.000
SET     448.511      100.000
[...]
SET     450.559      100.000
SET     450.559      100.000
---
GET       3.615        0.000
GET      16.895        5.000
GET      19.199       10.000
GET      20.479       15.000
GET      20.991       20.000
GET      21.503       25.000
GET      21.759       30.000
GET      22.143       35.000
GET      22.527       40.000
GET      22.911       45.000
GET      23.423       50.000
GET      23.679       52.500
GET      24.063       55.000
GET      24.319       57.500
GET      24.703       60.000
GET      24.959       62.500
GET      25.343       65.000
GET      25.727       67.500
GET      26.111       70.000
GET      26.623       72.500
GET      27.263       75.000
GET      27.519       76.250
GET      27.775       77.500
GET      28.287       78.750
GET      28.799       80.000
GET      29.311       81.250
GET      29.695       82.500
GET      30.079       83.750
GET      30.463       85.000
GET      30.847       86.250
GET      31.359       87.500
GET      31.743       88.125
GET      32.255       88.750
GET      32.767       89.375
GET      33.279       90.000
GET      33.791       90.625
GET      34.303       91.250
GET      34.815       91.875
GET      35.583       92.500
GET      36.351       93.125
GET      37.375       93.750
GET      37.887       94.062
GET      38.399       94.375
GET      38.655       94.688
GET      39.167       95.000
GET      39.679       95.312
GET      40.191       95.625
GET      40.447       95.938
GET      40.959       96.250
GET      41.471       96.562
GET      41.983       96.875
GET      42.239       97.031
GET      42.495       97.188
GET      43.007       97.344
GET      43.263       97.500
GET      43.519       97.656
GET      43.775       97.812
GET      44.031       97.969
GET      44.287       98.125
GET      44.543       98.281
GET      45.055       98.438
GET      45.055       98.516
GET      45.311       98.594
GET      45.567       98.672
GET      45.823       98.750
GET      46.079       98.828
GET      46.335       98.906
GET      46.591       98.984
GET      46.847       99.062
GET      47.103       99.141
GET      47.615       99.219
GET      47.615       99.258
GET      47.871       99.297
GET      48.127       99.336
GET      48.383       99.375
GET      48.639       99.414
GET      48.639       99.453
GET      48.895       99.492
GET      49.151       99.531
GET      49.407       99.570
GET      49.919       99.609
GET      50.175       99.629
GET      50.431       99.648
GET      50.687       99.668
GET      50.943       99.688
GET      51.199       99.707
GET      51.455       99.727
GET      52.223       99.746
GET      52.735       99.766
GET      53.503       99.785
GET      54.527       99.805
GET      55.295       99.814
GET      55.551       99.824
GET      56.063       99.834
GET      56.831       99.844
GET      57.855       99.854
GET      58.367       99.863
GET      59.391       99.873
GET      60.159       99.883
GET      61.183       99.893
GET      62.207       99.902
GET      62.719       99.907
GET      63.743       99.912
GET      64.767       99.917
GET      65.535       99.922
GET      66.047       99.927
GET      67.583       99.932
GET      68.095       99.937
GET      69.119       99.941
GET      70.143       99.946
GET      71.679       99.951
GET      72.703       99.954
GET      73.215       99.956
GET      74.239       99.958
GET      75.775       99.961
GET      77.311       99.963
GET      80.383       99.966
GET      82.431       99.968
GET     156.671       99.971
GET     211.967       99.973
GET     224.255       99.976
GET     228.351       99.977
GET     236.543       99.978
GET     239.615       99.979
GET     243.711       99.980
GET     249.855       99.982
GET     253.951       99.983
GET     261.119       99.984
GET     266.239       99.985
GET     303.103       99.987
GET     305.151       99.988
GET     313.343       99.988
GET     319.487       99.989
GET     323.583       99.990
GET     323.583       99.990
GET     325.631       99.991
GET     327.679       99.991
GET     329.727       99.992
GET     333.823       99.993
GET     344.063       99.993
GET     346.111       99.994
GET     356.351       99.994
GET     356.351       99.995
GET     401.407       99.995
GET     403.455       99.995
GET     403.455       99.995
GET     405.503       99.996
GET     413.695       99.996
GET     419.839       99.996
GET     419.839       99.997
GET     419.839       99.997
GET     419.839       99.997
[...]
GET     419.839       99.998
GET     419.839       99.998
GET     425.983       99.998
GET     425.983       99.998
GET     428.031       99.998
GET     428.031       99.998
GET     432.127       99.998
GET     432.127       99.999
GET     432.127       99.999
GET     432.127       99.999
[...]
GET     434.175       99.999
GET     434.175       99.999
GET     436.223       99.999
GET     436.223       99.999
GET     444.415       99.999
GET     444.415       99.999
GET     444.415       99.999
[...]
GET     448.511       99.999
GET     448.511      100.000
GET     448.511      100.000
GET     448.511      100.000
[...]
GET     450.559      100.000
GET     450.559      100.000
---
WAIT      0.000      100.000